accountsProxy/accountsProxy/src/gateway/duMockTargetServer/apiproxy/resources/node/du-mocks/usage/PrepaidGetUsage-Response.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.webservices.com/LCE/Du/WebServices" xmlns:head="http://www.du.ae/LCE/HeaderResponse" xmlns:lcew="http://xmlns.du.ae/LCE/Business/LCEWebServiceResponse" xmlns:prep="http://xmlns.du.ae/LCE/Business/ServiceManagement/PrepaidGetUsage">
   <soapenv:Header/>
   <soapenv:Body>
      <web:PrepaidGetUsageResponse>
         <Response>
            <head:Header>
               <!--Optional:-->
               <head:RequestId>?</head:RequestId>
               <!--Optional:-->
               <head:CorrelationId>?</head:CorrelationId>
               <head:ResponseCode>?</head:ResponseCode>
               <!--Optional:-->
               <head:ResponseMessage>?</head:ResponseMessage>
               <!--Optional:-->
               <head:ErrorCode>?</head:ErrorCode>
               <!--Optional:-->
               <head:ErrorDescription>?</head:ErrorDescription>
            </head:Header>
            <!--Optional:-->
            <lcew:Body>
               <!--Optional:-->
               <prep:Msisdn>?</prep:Msisdn>
               <!--Zero or more repetitions:-->
               <prep:Edr>
                  <!--Optional:-->
                  <prep:RecordDate>?</prep:RecordDate>
                  <!--Optional:-->
                  <prep:WalletType>?</prep:WalletType>
                  <!--Optional:-->
                  <prep:EdrType>?</prep:EdrType>
                  <!--Optional:-->
                  <prep:ChargingDomainId>?</prep:ChargingDomainId>
                  <!--Optional:-->
                  <prep:CallId>?</prep:CallId>
                  <!--Optional:-->
                  <prep:ScpId>?</prep:ScpId>
                  <!--Optional:-->
                  <prep:SequenceNumber>?</prep:SequenceNumber>
                  <!--Optional:-->
                  <prep:ExtraInformation>
                     <!--Optional:-->
                     <prep:EventClass>?</prep:EventClass>
                     <!--Optional:-->
                     <prep:EventName>?</prep:EventName>
                     <!--Optional:-->
                     <prep:Nack>?</prep:Nack>
                     <!--Optional:-->
                     <prep:Tcs>?</prep:Tcs>
                     <!--Optional:-->
                     <prep:AccountType>?</prep:AccountType>
                     <!--Optional:-->
                     <prep:AcsCustId>?</prep:AcsCustId>
                     <!--Optional:-->
                     <prep:Balances>
                        <!--Zero or more repetitions:-->
                        <prep:Balance>?</prep:Balance>
                     </prep:Balances>
                     <!--Optional:-->
                     <prep:BalanceTypes>
                        <!--Zero or more repetitions:-->
                        <prep:BalanceType>?</prep:BalanceType>
                     </prep:BalanceTypes>
                     <!--Optional:-->
                     <prep:BonusType>?</prep:BonusType>
                     <!--Optional:-->
                     <prep:Costs>
                        <!--Zero or more repetitions:-->
                        <prep:Cost>?</prep:Cost>
                     </prep:Costs>
                     <!--Optional:-->
                     <prep:Cs>?</prep:Cs>
                     <!--Optional:-->
                     <prep:DiscountType>?</prep:DiscountType>
                     <!--Optional:-->
                     <prep:Discounts>
                        <!--Zero or more repetitions:-->
                        <prep:Discount>?</prep:Discount>
                     </prep:Discounts>
                     <!--Optional:-->
                     <prep:Duration>?</prep:Duration>
                     <!--Optional:-->
                     <prep:Tn>?</prep:Tn>
                     <!--Optional:-->
                     <prep:Host>?</prep:Host>
                     <!--Optional:-->
                     <prep:NewBalanceExpiries>
                        <!--Zero or more repetitions:-->
                        <prep:NewBalanceExpirie>?</prep:NewBalanceExpirie>
                     </prep:NewBalanceExpiries>
                     <!--Optional:-->
                     <prep:OldBalanceExpiries>
                        <!--Zero or more repetitions:-->
                        <prep:OldBalanceExpirie>?</prep:OldBalanceExpirie>
                     </prep:OldBalanceExpiries>
                     <!--Optional:-->
                     <prep:NewAcctExpiry>?</prep:NewAcctExpiry>
                     <!--Optional:-->
                     <prep:NewAcctState>?</prep:NewAcctState>
                     <!--Optional:-->
                     <prep:OldAcctExpiry>?</prep:OldAcctExpiry>
                     <!--Optional:-->
                     <prep:OldAcctState>?</prep:OldAcctState>
                     <!--Optional:-->
                     <prep:Pi>?</prep:Pi>
                     <!--Optional:-->
                     <prep:Reference>?</prep:Reference>
                     <!--Optional:-->
                     <prep:Result>?</prep:Result>
                     <!--Optional:-->
                     <prep:User>?</prep:User>
                     <!--Optional:-->
                     <prep:VoucherType>?</prep:VoucherType>
                     <!--Optional:-->
                     <prep:TypeDescription>?</prep:TypeDescription>
                     <!--Optional:-->
                     <prep:Voucher>?</prep:Voucher>
                     <!--Optional:-->
                     <prep:VoucherNumber>?</prep:VoucherNumber>
                     <!--Optional:-->
                     <prep:WalletType>?</prep:WalletType>
                     <!--Optional:-->
                     <prep:Fca>?</prep:Fca>
                     <!--Optional:-->
                     <prep:Channel>?</prep:Channel>
                     <!--Optional:-->
                     <prep:Imei>?</prep:Imei>
                     <!--Optional:-->
                     <prep:OrigValue>?</prep:OrigValue>
                     <!--Optional:-->
                     <prep:EventCount>?</prep:EventCount>
                  </prep:ExtraInformation>
               </prep:Edr>
            </lcew:Body>
         </Response>
      </web:PrepaidGetUsageResponse>
   </soapenv:Body>
</soapenv:Envelope>